n3rd-bugs/weird-rtos/port/target/atmegaxx4/io/serial/usart_avr.c
/*
 * usart_avr.c
 *
 * Copyright (c) 2014 Usama Masood <mirzaon@gmail.com> All rights reserved.
 *
 * This file is part of a non-commercial software. For more details please
 * refer to the license agreement that comes with this software.
 *
 * If you have not received a license file please contact:
 *  Usama Masood <mirzaon@gmail.com>
 *
 */
#include <kernel.h>
#ifdef CONFIG_SERIAL
#include <usart_avr.h>
#include <stdio.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <idle.h>

#ifdef SERIAL_INTERRUPT_MODE
#ifndef FS_CONSOLE
#error "Console is required for interrupt mode serial."
#endif /* FS_CONSOLE */
#endif /* SERIAL_INTERRUPT_MODE */

/* Internal function prototypes. */
static int32_t usart_avr_init(void *);
static void usart_handle_tx_interrupt(AVR_USART *);
static void usart_handle_rx_interrupt(AVR_USART *);
static void usart_avr_enable_interrupt(void *);
static void usart_avr_disable_interrupt(void *);
static int32_t usart_avr_puts(void *, void *, const uint8_t *, int32_t, uint32_t);
static int32_t usart_avr_gets(void *, void *, uint8_t *, int32_t, uint32_t);
static void usart_avr_recover_rts(void *);
static void usart_avr_toggle_delay(void);

/* Target serial port. */
static AVR_USART usart0;
#ifdef SERIAL_INTERRUPT_MODE
static FS_BUFFER_DATA usart0_buffer_data;
static uint8_t usart0_buffer_space[SERIAL_MAX_BUFFER_SIZE * SERIAL_NUM_BUFFERS];
static FS_BUFFER usart0_buffer_ones[SERIAL_NUM_BUFFERS];
static FS_BUFFER_LIST usart0_buffer_lists[SERIAL_NUM_BUFFER_LIST];
#endif /* SERIAL_INTERRUPT_MODE */

/* USART data for each device in the system. */
static AVR_USART *avr_usart0;
#if USART1_AVAILABLE
static AVR_USART *avr_usart1;
#endif /* USART1_AVAILABLE */

/*
 * serial_avr_init
 * This will initialize serial interface(s) for this target.
 */
void serial_avr_init(void)
{
    uint8_t enable_hw_flow;

#ifdef SERIAL_ENABLE_HW_FLOW
    enable_hw_flow = TRUE;
#else
    enable_hw_flow = FALSE;
#endif /* SERIAL_ENABLE_HW_FLOW */

#ifdef SERIAL_INTERRUPT_MODE
    /* Initialize buffer data. */
    usart0_buffer_data.buffer_space = usart0_buffer_space;
    usart0_buffer_data.buffer_size = SERIAL_MAX_BUFFER_SIZE;
    usart0_buffer_data.buffers = usart0_buffer_ones;
    usart0_buffer_data.num_buffers = SERIAL_NUM_BUFFERS;
    usart0_buffer_data.buffer_lists = usart0_buffer_lists;
    usart0_buffer_data.num_buffer_lists = SERIAL_NUM_BUFFER_LIST;

    /* Register an AVR USART. */
    usart_avr_register(&usart0, "usart0", 0, SERIAL_BAUD_RATE, &usart0_buffer_data, enable_hw_flow, TRUE);
#else
    /* Register an AVR USART. */
    usart_avr_register(&usart0, "usart0", 0, SERIAL_BAUD_RATE, NULL, enable_hw_flow, TRUE);
#endif /* SERIAL_INTERRUPT_MODE */

} /* serial_avr_init */

/*
 * usart_avr_register
 * @usart: AVR USART to be registered.
 * @name: Name of this USART instance.
 * @device_num: USART device number we need to register.
 * @boud_rate: USART baud rate.
 * @buffer_data: Buffer data for this USART, if not null USART interrupt mode
 *  will be enabled.
 * @hw_flow: If we need to enable hardware flow control for this USART.
 * @is_debug: If this USART is needed to be used as debug console.
 * @return: Success will be returned if USART was successfully registered,
 *  SERIAL_NOT_FOUND will be returned if requested serial device was not found.
 * This will register an AVR USART device.
 */
void usart_avr_register(AVR_USART *usart, const char *name, uint8_t num, uint32_t baudrate, FS_BUFFER_DATA *buffer_data, uint8_t enable_hw_flow, uint8_t is_debug)
{
    uint32_t flags;

    /* Initialize AVR debug USART data. */
    usart->num = num;
    usart->baudrate = baudrate;
    usart->hw_flow_enabled = enable_hw_flow;

    /* Initialize serial device data. */
    usart->serial.device.init = &usart_avr_init;
    usart->serial.device.puts = &usart_avr_puts;
    usart->serial.device.gets = &usart_avr_gets;
    usart->serial.device.data = usart;

    /* If this is a debug USART. */
    if (is_debug)
    {
        /* Set debug flag. */
        flags = SERIAL_DEBUG;
    }
    else
    {
        /* Clear debug flag. */
        flags = 0;
    }

    /* If we buffer data for this device. */
    if (buffer_data != NULL)
    {
        /* Enable interrupt flag. */
        flags |= SERIAL_INT;

        /* Setup interrupt manipulation APIs. */
        usart->serial.device.int_lock = &usart_avr_disable_interrupt;
        usart->serial.device.int_unlock = &usart_avr_enable_interrupt;

        /* Register this USART with serial file system. */
        serial_register(&usart->serial, name, buffer_data, flags);
    }
    else
    {
        /* Register this USART with serial file system. */
        serial_register(&usart->serial, name, NULL, flags);
    }

} /* usart_avr_register */

/*
 * usart_avr_init
 * @return: Success if device was successfully initialized,
 *  SERIAL_NOT_FOUND will be returned if requested serial device was not found.
 * This function initializes a USART device for AVR.
 */
static int32_t usart_avr_init(void *data)
{
    AVR_USART *usart = (AVR_USART *)data;
    int32_t status = SUCCESS;
    uint16_t ubrr_val_u1x, ubrr_val_u2x;
    double baud_u1x, baud_u2x, error_u1x, error_u2x;

    /* Calculate the UBRR values. */
    ubrr_val_u1x = (((F_CPU) - (8UL * usart->baudrate)) / (16UL * usart->baudrate));
    ubrr_val_u2x = (((F_CPU) - (4UL * usart->baudrate)) / (8UL * usart->baudrate));

    /* Recalculate resulting baudrate. */
    baud_u1x = F_CPU / ((16UL * ubrr_val_u1x) + 8UL);
    baud_u2x = F_CPU / ((8UL * ubrr_val_u1x) + 4UL);

    /* Calculate the error rating. */
    error_u1x = (baud_u1x / usart->baudrate) - 1;
    error_u2x = (baud_u2x / usart->baudrate) - 1;

    /* Build absolute value of error. */
    if (error_u1x < 0)
    {
        error_u1x *= -1.0;
    }

    /* Build absolute value of error. */
    if (error_u2x < 0)
    {
        error_u2x *= -1.0;
    }

    /* Process according to the device number. */
    switch (usart->num)
    {
    /* If this is USART0. */
    case 0:
        /* If HW flow control is enabled. */
        if (usart->hw_flow_enabled == TRUE)
        {
            /* Configure CTS pin as input.  */
            USART0_HW_CTS_DDR &= (uint8_t)~(1 << USART0_HW_CTS);

