n3rd-bugs/weird-rtos/port/target/atmegaxx4/io/serial/usart_avr.c
            /* Configure RTS pin as input.  */
            USART0_HW_RTS_DDR &= (uint8_t)~(1 << USART0_HW_RTS);

            /* Configure RTS reset pin as output. */
            USART0_HW_RTS_RESET_DDR |= (1 << USART0_HW_RTS_RESET);
            USART0_HW_RTS_RESET_PORT |= (1 << USART0_HW_RTS_RESET);

            /* Register work to recover RTS. */
            idle_add_work(&usart_avr_recover_rts, usart);
        }

        /* Only choose U2X if error rating is better. */
        if (error_u1x <= error_u2x)
        {
            UCSR0A &= (uint8_t)~(1 << U2X0);
            UBRR0H = ubrr_val_u1x >> 8;
            UBRR0L = ubrr_val_u1x  & 0xFF;
        }
        else
        {
            UCSR0A |= (1 << U2X0);
            UBRR0H = ubrr_val_u2x >> 8;
            UBRR0L = ubrr_val_u2x  & 0xFF;
        }

        /* Enable RX and TX. */
        UCSR0B = (1 << RXEN0)  | (1 << TXEN0);
        UCSR0C = (1 << USBS0) | (3 << UCSZ00);

        /* Should never happen. */
        ASSERT(avr_usart0 != NULL);

        /* Save USART data. */
        avr_usart0 = usart;

        break;

#if USART1_AVAILABLE
    /* If this is USART1. */
    case 1:
        /* If HW flow control is enabled. */
        if (usart->hw_flow_enabled == TRUE)
        {
            /* Configure CTS pin as input.  */
            USART1_HW_CTS_DDR &= (uint8_t)~(1 << USART1_HW_CTS);

            /* Configure RTS pin as input.  */
            USART1_HW_RTS_DDR &= (uint8_t)~(1 << USART1_HW_RTS);

            /* Configure RTS reset pin as output. */
            USART1_HW_RTS_RESET_DDR |= (1 << USART1_HW_RTS_RESET);
            USART1_HW_RTS_RESET_PORT |= (1 << USART1_HW_RTS_RESET);

            /* Register work to recover RTS. */
            idle_add_work(&usart_avr_recover_rts, usart);
        }

        /* Only choose U2X if error rating is better. */
        if (error_u1x <= error_u2x)
        {
            UCSR1A &= (uint8_t)~(1 << U2X0);
            UBRR1H = ubrr_val_u1x >> 8;
            UBRR1L = ubrr_val_u1x  & 0xFF;
        }
        else
        {
            UCSR1A |= (1 << U2X1);
            UBRR1H = ubrr_val_u2x >> 8;
            UBRR1L = ubrr_val_u2x  & 0xFF;
        }

        /* Enable RX and TX. */
        UCSR1B = (1 << RXEN1)  | (1 << TXEN1);
        UCSR1C = (1 << USBS1) | (3 << UCSZ10);

        /* Should never happen. */
        ASSERT(avr_usart1 != NULL);

        /* Save USART data. */
        avr_usart1 = usart;

        break;
#endif /* USART1_AVAILABLE */

    default:

        /* Requested serial device was not found. */
        status = SERIAL_NOT_FOUND;

        break;
    }

    /* Return status to the caller. */
    return (status);

} /* usart_avr_init */

/*
 * ISR(USART0_TX_vect, ISR_NAKED)
 * This is USART0 TX interrupt.
 */
ISR(USART0_TX_vect, ISR_NAKED)
{
    ISR_ENTER();

    /* Should never happen. */
    ASSERT(avr_usart0 == NULL);

    /* Handle TX interrupt. */
    usart_handle_tx_interrupt(avr_usart0);

    ISR_EXIT();

} /* ISR(USART0_TX_vect, ISR_NAKED) */

#if USART1_AVAILABLE
/*
 * ISR(USART1_TX_vect, ISR_NAKED)
 * This is USART1 TX interrupt.
 */
ISR(USART1_TX_vect, ISR_NAKED)
{
    ISR_ENTER();

    /* Should never happen. */
    ASSERT(avr_usart1 == NULL);

    /* Handle TX interrupt. */
    usart_handle_tx_interrupt(avr_usart1);

    ISR_EXIT();

} /* ISR(USART1_TX_vect, ISR_NAKED) */
#endif /* USART1_AVAILABLE */

/*
 * usart_handle_tx_interrupt
 * This function handles TX interrupt.
 */
static void usart_handle_tx_interrupt(AVR_USART *usart)
{
    FS_BUFFER_LIST *buffer;
    uint8_t chr;

    /* Get a buffer to be transmitted. */
    buffer = fs_buffer_get(usart, FS_BUFFER_TX, FS_BUFFER_INPLACE);

    /* If we have a buffer to transmit. */
    if (buffer != NULL)
    {
        /* Pull a byte from the buffer. */
        fs_buffer_list_pull(buffer, &chr, 1, 0);

        /* If there is nothing more to be sent from this buffer. */
        if (buffer->total_length == 0)
        {
            /* Actually remove this buffer. */
            buffer = fs_buffer_get(usart, FS_BUFFER_TX, 0);

            /* Free this buffer. */
            fs_buffer_add(usart, buffer, FS_LIST_FREE, FS_BUFFER_ACTIVE);
        }

        /* Process according to the device number. */
        switch (usart->num)
        {
        /* If this is USART0. */
        case 0:
            /* If HW flow control is enabled. */
            if (usart->hw_flow_enabled == TRUE)
            {
                /* Wait for CTS signal. */
                while (USART0_HW_CTS_PIN & (1 << USART0_HW_CTS)) ;
            }

            /* Put a byte on USART to continue TX. */
            UDR0 = ((uint32_t)chr) & 0xFF;

            break;

#if USART1_AVAILABLE
        /* If this is USART1. */
        case 1:
            /* If HW flow control is enabled. */
            if (usart->hw_flow_enabled == TRUE)
            {
                /* Wait for CTS signal. */
                while (USART1_HW_CTS_PIN & (1 << USART1_HW_CTS)) ;
            }

            /* Put a byte on USART to continue TX. */
            UDR1 = ((uint32_t)chr) & 0xFF;

            break;
#endif /* USART1_AVAILABLE */
        }
    }
    else
    {
        /* Clear the in TX flag. */
        usart->serial.flags &= (uint32_t)(~SERIAL_IN_TX);
    }

} /* usart_handle_tx_interrupt */

/*
 * ISR(USART0_RX_vect, ISR_NAKED)
 * This is USART0 RX interrupt.
 */
ISR(USART0_RX_vect, ISR_NAKED)
{
    ISR_ENTER();

    /* Should never happen. */
    ASSERT(avr_usart0 == NULL);

    /* While we have a byte to read. */
    while (UCSR0A & (1 << RXC0))
    {
        /* Handle RX interrupt. */
        usart_handle_rx_interrupt(avr_usart0);
    }

    ISR_EXIT();

} /* ISR(USART0_RX_vect, ISR_NAKED) */

#if USART1_AVAILABLE
/*
 * ISR(USART1_RX_vect, ISR_NAKED)
 * This is USART1 RX interrupt.
 */
ISR(USART1_RX_vect, ISR_NAKED)
{
    ISR_ENTER();

    /* Should never happen. */
    ASSERT(avr_usart1 == NULL);

    /* While we have a byte to read. */
    while (UCSR1A & (1 << RXC1))
    {
        /* Handle RX interrupt. */
        usart_handle_rx_interrupt(avr_usart1);
    }

    ISR_EXIT();

