n3rd-bugs/weird-rtos/port/target/atmegaxx4/io/serial/usart_avr.c
} /* ISR(USART1_RX_vect, ISR_NAKED) */
#endif /* USART1_AVAILABLE */

/*
 * usart_handle_rx_interrupt
 * This function handles RX interrupt.
 */
static void usart_handle_rx_interrupt(AVR_USART *usart)
{
    FS_BUFFER_LIST *buffer;
    uint8_t chr;

    /* Process according to the device number. */
    switch (usart->num)
    {
    /* If this is USART0. */
    case 0:
        /* Read the incoming data and also clear the interrupt. */
        chr = (uint8_t)UDR0;

        /* If HW flow control is enabled. */
        if (usart->hw_flow_enabled == TRUE)
        {
            /* Toggle RTS reset. */
            USART0_HW_RTS_RESET_PORT &= (uint8_t)~(1 << USART0_HW_RTS_RESET);
            usart_avr_toggle_delay();
            USART0_HW_RTS_RESET_PORT |= (1 << USART0_HW_RTS_RESET);
        }
        break;

#if USART1_AVAILABLE
    /* If this is USART1. */
    case 1:
        /* Read the incoming data and also clear the interrupt. */
        chr = (uint8_t)UDR1;

        /* If HW flow control is enabled. */
        if (usart->hw_flow_enabled == TRUE)
        {
            /* Toggle RTS reset. */
            USART1_HW_RTS_RESET_PORT &= (uint8_t)~(1 << USART1_HW_RTS_RESET);
            usart_avr_toggle_delay();
            USART1_HW_RTS_RESET_PORT |= (1 << USART1_HW_RTS_RESET);
        }

        break;
#endif /* USART1_AVAILABLE */
    }

    /* Get a RX buffer. */
    buffer = fs_buffer_get(usart, FS_BUFFER_RX, FS_BUFFER_INPLACE);

    /* If we don't have a buffer. */
    if (buffer == NULL)
    {
        /* Get a buffer. */
        buffer = fs_buffer_get(usart, FS_LIST_FREE, 0);

        /* If we do have a buffer. */
        if (buffer != NULL)
        {
            /* Add this buffer on the receive list. */
            fs_buffer_add(usart, buffer, FS_BUFFER_RX, 0);
        }
    }

    /* If we do have a buffer. */
    if (buffer != NULL)
    {
        /* Append received byte on the buffer. */
        fs_buffer_list_push(buffer, &chr, 1, 0);

        /* Tell upper layers that some data is available to read. */
        fd_data_available(usart);
    }

} /* usart_handle_rx_interrupt */

/*
 * usart_avr_enable_interrupt.
 * This function will enable interrupts for the given USART.
 */
static void usart_avr_enable_interrupt(void *data)
{
    AVR_USART *usart = (AVR_USART *)data;

    /* Process according to the device number. */
    switch (usart->num)
    {
    /* If this is USART0. */
    case 0:
        /* Enable the USART0 IRQ channel. */
        UCSR0B |= ((1 << RXCIE0) | (1 << TXCIE0));

        break;

#if USART1_AVAILABLE
    /* If this is USART1. */
    case 1:
        /* Enable the USART0 IRQ channel. */
        UCSR1B |= ((1 << RXCIE1) | (1 << TXCIE1));

        break;
#endif /* USART1_AVAILABLE */
    }

} /* usart_avr_enable_interrupt */

/*
 * usart_avr_disable_interrupt.
 * This function will disable interrupts for the given USART.
 */
static void usart_avr_disable_interrupt(void *data)
{
    AVR_USART *usart = (AVR_USART *)data;

    /* Process according to the device number. */
    switch (usart->num)
    {
    /* If this is USART0. */
    case 0:
        /* Disable the USART0 IRQ channel. */
        UCSR0B &= ((uint8_t)~((1 << RXCIE0) | (1 << TXCIE0)));

        break;

#if USART1_AVAILABLE
    /* If this is USART1. */
    case 1:
        /* Disable the USART0 IRQ channel. */
        UCSR1B &= ((uint8_t)~((1 << RXCIE1) | (1 << TXCIE1)));

        break;
#endif /* USART1_AVAILABLE */
    }

} /* usart_avr_disable_interrupt */

/*
 * usart_avr_puts
 * @fd: Serial file descriptor.
 * @priv_data: USART data.
 * @buf: Data needed to be sent over USART.
 * @nbytes: Number of bytes to be printed from the buffer.
 * @flags: Flags to specify the operation.
 * This function sends a buffer on the given USART.
 */
static int32_t usart_avr_puts(void *fd, void *priv_data, const uint8_t *buf, int32_t nbytes, uint32_t flags)
{
    int32_t to_print = nbytes;
    AVR_USART *usart = (AVR_USART *)priv_data;
    FS_BUFFER_LIST *buffer;
    uint8_t chr;

    /* If we need to put this string using interrupts. */
    if (flags & SERIAL_INT)
    {
        /* Get a buffer to be transmitted. */
        buffer = fs_buffer_get(fd, FS_BUFFER_TX, FS_BUFFER_INPLACE);

        /* If we have a buffer and we are in TX. */
        if ((buffer != NULL) && ((usart->serial.flags & SERIAL_IN_TX) == 0))
        {
            /* Set the in TX flag. */
            usart->serial.flags |= SERIAL_IN_TX;

            /* Pull a byte from the buffer. */
            fs_buffer_list_pull(buffer, &chr, 1, 0);

            if (buffer->total_length == 0)
            {
                /* Actually remove this buffer. */
                buffer = fs_buffer_get(fd, FS_BUFFER_TX, 0);

                /* Free this buffer. */
                fs_buffer_add(fd, buffer, FS_LIST_FREE, FS_BUFFER_ACTIVE);
            }

            /* Process according to the device number. */
            switch (usart->num)
            {
            /* If this is USART0. */
            case 0:
                /* If HW flow control is enabled. */
                if (usart->hw_flow_enabled == TRUE)
                {
                    /* Wait for CTS signal. */
                    while (USART0_HW_CTS_PIN & (1 << USART0_HW_CTS)) ;
                }

                /* Put a byte on USART to start TX. */
                UDR0 = (chr);

                break;

#if USART1_AVAILABLE
            /* If this is USART1. */
            case 1:
                /* If HW flow control is enabled. */
                if (usart->hw_flow_enabled == TRUE)
                {
                    /* Wait for CTS signal. */
                    while (USART1_HW_CTS_PIN & (1 << USART1_HW_CTS)) ;
                }

                /* Put a byte on USART to start TX. */
                UDR1 = (chr);

                break;
#endif /* USART1_AVAILABLE */
            }
        }
    }
    else
    {
        /* Disable USART interrupts. */
        usart_avr_disable_interrupt(usart);

        /* Process according to the device number. */
        switch (usart->num)
        {
        /* If this is USART0. */
        case 0:
            /* While we have some data to be printed. */
            while (nbytes > 0)
            {
                /* If HW flow control is enabled. */
                if (usart->hw_flow_enabled == TRUE)
                {
                    /* Wait for CTS signal. */
                    while (USART0_HW_CTS_PIN & (1 << USART0_HW_CTS)) ;
                }

                /* Add this byte. */
                UDR0 = (*buf);

                /* Wait for this byte to be sent. */
                while ((UCSR0A & (1 << UDRE0)) == 0)
                {
                    ;
                }

                /* Decrement number of bytes remaining. */
                nbytes --;

