n3rd-bugs/weird-rtos/port/target/atmegaxx4/io/serial/usart_avr.c
                /* Move forward in the buffer. */
                buf++;
            }

            break;

#if USART1_AVAILABLE
        /* If this is USART1. */
        case 1:
            /* While we have some data to be printed. */
            while (nbytes > 0)
            {
                /* If HW flow control is enabled. */
                if (usart->hw_flow_enabled == TRUE)
                {
                    /* Wait for CTS signal. */
                    while (USART1_HW_CTS_PIN & (1 << USART1_HW_CTS)) ;
                }

                /* Add this byte. */
                UDR1 = (*buf);

                /* Wait for this byte to be sent. */
                while ((UCSR1A & (1 << UDRE1)) == 0)
                {
                    ;
                }

                /* Decrement number of bytes remaining. */
                nbytes --;

                /* Move forward in the buffer. */
                buf++;
            }

            break;
#endif /* USART1_AVAILABLE */
        }
    }

    /* Return number of bytes printed. */
    return (to_print - nbytes);

} /* usart_avr_puts */

/*
 * usart_avr_gets
 * @fd: Serial file descriptor.
 * @priv_data: USART data.
 * @buf: Data received will be returned in this buffer.
 * @nbytes: Number of bytes received on serial port.
 * @flags: For now unused.
 * This function receives and return data from a serial port.
 */
static int32_t usart_avr_gets(void *fd, void *priv_data, uint8_t *buf, int32_t nbytes, uint32_t flags)
{
    AVR_USART *usart = (AVR_USART *)priv_data;
    int32_t to_read = nbytes;

    /* Remove some compiler warnings. */
    UNUSED_PARAM(fd);
    UNUSED_PARAM(flags);

    /* Disable USART interrupts. */
    usart_avr_disable_interrupt(usart);

    /* Process according to the device number. */
    switch (usart->num)
    {
    /* If this is USART0. */
    case 0:
        /* While we have some data to be printed. */
        while (nbytes > 0)
        {
            /* While we have a byte to read. */
            while ((UCSR0A & (1 << RXC0)) == 0)
            {
                /* Yield the current task. */
                task_yield();
            }

            /* Read a byte from USART. */
            *buf = (uint8_t)UDR0;

            /* If HW flow control is enabled. */
            if (usart->hw_flow_enabled == TRUE)
            {
                /* Toggle RTS reset. */
                USART0_HW_RTS_RESET_PORT &= (uint8_t)~(1 << USART0_HW_RTS_RESET);
                usart_avr_toggle_delay();
                USART0_HW_RTS_RESET_PORT |= (1 << USART0_HW_RTS_RESET);
            }

            /* Decrement number of bytes remaining. */
            nbytes --;

            /* Move forward in the buffer. */
            buf++;
        }

        break;

#if USART1_AVAILABLE
    /* If this is USART1. */
    case 1:
        /* While we have some data to be printed. */
        while (nbytes > 0)
        {
            /* While we have a byte to read. */
            while ((UCSR1A & (1 << RXC1)) == 0)
            {
                /* Yield the current task. */
                task_yield();
            }

            /* Read a byte from USART. */
            *buf = (uint8_t)UDR1;

            /* If HW flow control is enabled. */
            if (usart->hw_flow_enabled == TRUE)
            {
                /* Toggle RTS reset. */
                USART1_HW_RTS_RESET_PORT &= (uint8_t)~(1 << USART1_HW_RTS_RESET);
                usart_avr_toggle_delay();
                USART1_HW_RTS_RESET_PORT |= (1 << USART1_HW_RTS_RESET);
            }

            /* Decrement number of bytes remaining. */
            nbytes --;

            /* Move forward in the buffer. */
            buf++;
        }

        break;
#endif /* USART1_AVAILABLE */
    }

    /* Return number of bytes read. */
    return (to_read - nbytes);

} /* usart_avr_gets */

/*
 * usart_avr_recover_rts
 * @data: USART for which we need to recover RTS.
 * This function will try to recover the RTS signal if it gets asserted
 * Indefinitely without any incoming frame.
 */
static void usart_avr_recover_rts(void *data)
{
    AVR_USART *usart = (AVR_USART *)data;

    /* If HW flow control is enabled. */
    if (usart->hw_flow_enabled == TRUE)
    {
        /* Process according to the device number. */
        switch (usart->num)
        {
        /* If this is USART0. */
        case 0:

            /* If RTS is in reset state. */
            if (!(USART0_HW_RTS_PIN & (1 << USART0_HW_RTS)))
            {
                /* Try to lock USART. */
                if (fd_try_get_lock(usart, 0) == SUCCESS)
                {
                    /* Toggle RTS reset. */
                    USART0_HW_RTS_RESET_PORT &= (uint8_t)~(1 << USART0_HW_RTS_RESET);
                    usart_avr_toggle_delay();
                    USART0_HW_RTS_RESET_PORT |= (1 << USART0_HW_RTS_RESET);

                    /* Release USART lock. */
                    fd_release_lock(usart);
                }
            }

            break;

#if USART1_AVAILABLE
        /* If this is USART1. */
        case 1:

            /* If RTS is in reset state. */
            if (!(USART1_HW_RTS_PIN & (1 << USART1_HW_RTS)))
            {
                /* Try to lock USART. */
                if (fd_try_get_lock(usart, 0) == SUCCESS)
                {
                    /* Toggle RTS reset. */
                    USART1_HW_RTS_RESET_PORT &= (uint8_t)~(1 << USART1_HW_RTS_RESET);
                    usart_avr_toggle_delay();
                    USART1_HW_RTS_RESET_PORT |= (1 << USART1_HW_RTS_RESET);

                    /* Release USART lock. */
                    fd_release_lock(usart);
                }
            }

            break;
#endif /* USART1_AVAILABLE */
        }
    }

} /* usart_avr_recover_rts */

/*
 * usart_avr_toggle_delay
 * This function will add some delay when toggling RTS pin.
 */
static void usart_avr_toggle_delay(void)
{
#if (USART_HW_TOGGLE_DELAY > 0)
    volatile uint8_t i;

    /* Add some delay. */
    for (i = 0; i < USART_HW_TOGGLE_DELAY; i++)
    {
        asm volatile("nop");
    }
#endif /* (USART_HW_TOGGLE_DELAY > 0) */

} /* usart_avr_toggle_delay */
#endif /* CONFIG_SERIAL */
